of222/tutorials/rheoInterFoam/DieSwell/Oldroyd-BLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
   inlet
    {
       type            fixedValue;
       value           uniform (0.333333 0 0);
    }
    
    outlet
    {
       type            zeroGradient;
    }
    
    wallIn
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    
    wallOut
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    
    atmosphere
    {
         type          zeroGradient;
    }
    
    symmetry
    {
       type            symmetryPlane;
    }
}
 
